{
  "broker": {
    "broker.id": {
      "scope": "broker",
      "default": null,
      "description": "Each broker is uniquely identified by a non-negative integer id. This id serves as the broker's \"name\" and allows the broker to be moved to a different host/port without confusing consumers. You can choose any number you like so long as it is unique.\n    "
    },
    "log.dirs": {
      "scope": "broker",
      "default": "/tmp/kafka-logs",
      "description": "A comma-separated list of one or more directories in which Kafka data is stored. Each new partition that is created will be placed in the directory which currently has the fewest partitions."
    },
    "port": {
      "scope": "broker",
      "default": "6667",
      "description": "The port on which the server accepts client connections."
    },
    "zookeeper.connect": {
      "scope": "broker",
      "default": "null",
      "description": "Specifies the ZooKeeper connection string in the form hostname:port, where hostname and port are the host and port for a node in your ZooKeeper cluster. To allow connecting through other ZooKeeper nodes when that host is down you can also specify multiple hosts in the form hostname1:port1,hostname2:port2,hostname3:port3.\n    \nZooKeeper also allows you to add a \"chroot\" path which will make all kafka data for this cluster appear under a particular path. This is a way to setup multiple Kafka clusters or other applications on the same ZooKeeper cluster. To do this give a connection string in the form hostname1:port1,hostname2:port2,hostname3:port3/chroot/path which would put all this cluster's data under the path /chroot/path. Note that you must create this path yourself prior to starting the broker and consumers must use the same connection string."
    },
    "message.max.bytes": {
      "scope": "broker",
      "default": "1000000",
      "description": "The maximum size of a message that the server can receive. It is important that this property be in sync with the maximum fetch size your consumers use or else an unruly producer will be able to publish messages too large for consumers to consume."
    },
    "num.network.threads": {
      "scope": "broker",
      "default": "3",
      "description": "The number of network threads that the server uses for handling network requests. You probably don't need to change this."
    },
    "num.io.threads": {
      "scope": "broker",
      "default": "8",
      "description": "The number of I/O threads that the server uses for executing requests. You should have at least as many threads as you have disks."
    },
    "background.threads": {
      "scope": "broker",
      "default": "4",
      "description": "The number of threads to use for various background processing tasks such as file deletion. You should not need to change this."
    },
    "queued.max.requests": {
      "scope": "broker",
      "default": "500",
      "description": "The number of requests that can be queued up for processing by the I/O threads before the network threads stop reading in new requests."
    },
    "host.name": {
      "scope": "broker",
      "default": "null",
      "description": "\nHostname of broker. If this is set, it will only bind to this address. If this is not set, it will bind to all interfaces, and publish one to ZK.\n"
    },
    "advertised.host.name": {
      "scope": "broker",
      "default": "null",
      "description": "\nIf this is set this is the hostname that will be given out to producers, consumers, and other brokers to connect to.\n"
    },
    "advertised.port": {
      "scope": "broker",
      "default": "null",
      "description": "\nThe port to give out to producers, consumers, and other brokers to use in establishing connections. This only needs to be set if this port is different from the port the server should bind to.\n"
    },
    "socket.send.buffer.bytes": {
      "scope": "broker",
      "default": "100 * 1024",
      "description": "The SO_SNDBUFF buffer the server prefers for socket connections."
    },
    "socket.receive.buffer.bytes": {
      "scope": "broker",
      "default": "100 * 1024",
      "description": "The SO_RCVBUFF buffer the server prefers for socket connections."
    },
    "socket.request.max.bytes": {
      "scope": "broker",
      "default": "100 * 1024 * 1024",
      "description": "The maximum request size the server will allow. This prevents the server from running out of memory and should be smaller than the Java heap size."
    },
    "num.partitions": {
      "scope": "broker",
      "default": "1",
      "description": "The default number of partitions per topic if a partition count isn't given at topic creation time."
    },
    "log.segment.bytes": {
      "scope": "broker",
      "default": "1024 * 1024 * 1024",
      "description": "The log for a topic partition is stored as a directory of segment files. This setting controls the size to which a segment file will grow before a new segment is rolled over in the log. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.roll.hours": {
      "scope": "broker",
      "default": "24 * 7",
      "description": "This setting will force Kafka to roll a new log segment even if the log.segment.bytes size has not been reached. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.cleanup.policy": {
      "scope": "broker",
      "default": "delete",
      "description": "This can take either the value delete or compact. If delete is set, log segments will be deleted when they reach the size or time limits set. If compact is set log compaction will be used to clean out obsolete records. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.retention.{minutes,hours}": {
      "scope": "broker",
      "default": "7 days",
      "description": "The amount of time to keep a log segment before it is deleted, i.e. the default data retention window for all topics. Note that if both log.retention.minutes and log.retention.bytes are both set we delete a segment when either limit is exceeded. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.retention.bytes": {
      "scope": "broker",
      "default": "-1",
      "description": "The amount of data to retain in the log for each topic-partitions. Note that this is the limit per-partition so multiply by the number of partitions to get the total data retained for the topic. Also note that if both log.retention.hours and log.retention.bytes are both set we delete a segment when either limit is exceeded. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.retention.check.interval.ms": {
      "scope": "broker",
      "default": "5 minutes",
      "description": "The period with which we check whether any log segment is eligible for deletion to meet the retention policies."
    },
    "log.cleaner.enable": {
      "scope": "broker",
      "default": "false",
      "description": "This configuration must be set to true for log compaction to run."
    },
    "log.cleaner.threads": {
      "scope": "broker",
      "default": "1",
      "description": "The number of threads to use for cleaning logs in log compaction."
    },
    "log.cleaner.io.max.bytes.per.second": {
      "scope": "broker",
      "default": "None",
      "description": "The maximum amount of I/O the log cleaner can do while performing log compaction. This setting allows setting a limit for the cleaner to avoid impacting live request serving."
    },
    "log.cleaner.dedupe.buffer.size": {
      "scope": "broker",
      "default": "500*1024*1024",
      "description": "The size of the buffer the log cleaner uses for indexing and deduplicating logs during cleaning. Larger is better provided you have sufficient memory."
    },
    "log.cleaner.io.buffer.size": {
      "scope": "broker",
      "default": "512*1024",
      "description": "The size of the I/O chunk used during log cleaning. You probably don't need to change this."
    },
    "log.cleaner.io.buffer.load.factor": {
      "scope": "broker",
      "default": "0.9",
      "description": "The load factor of the hash table used in log cleaning. You probably don't need to change this."
    },
    "log.cleaner.backoff.ms": {
      "scope": "broker",
      "default": "15000",
      "description": "The interval between checks to see if any logs need cleaning."
    },
    "log.cleaner.min.cleanable.ratio": {
      "scope": "broker",
      "default": "0.5",
      "description": "This configuration controls how frequently the log compactor will attempt to clean the log (assuming log compaction is enabled). By default we will avoid cleaning a log where more than 50% of the log has been compacted. This ratio bounds the maximum space wasted in the log by duplicates (at 50% at most 50% of the log could be duplicates). A higher ratio will mean fewer, more efficient cleanings but will mean more wasted space in the log. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.cleaner.delete.retention.ms": {
      "scope": "broker",
      "default": "1 day",
      "description": "The amount of time to retain delete tombstone markers for log compacted topics. This setting also gives a bound on the time in which a consumer must complete a read if they begin from offset 0 to ensure that they get a valid snapshot of the final stage (otherwise delete tombstones may be collected before they complete their scan). This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.index.size.max.bytes": {
      "scope": "broker",
      "default": "10 * 1024 * 1024",
      "description": "The maximum size in bytes we allow for the offset index for each log segment. Note that we will always pre-allocate a sparse file with this much space and shrink it down when the log rolls. If the index fills up we will roll a new log segment even if we haven't reached the log.segment.bytes limit. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "log.index.interval.bytes": {
      "scope": "broker",
      "default": "4096",
      "description": "The byte interval at which we add an entry to the offset index. When executing a fetch request the server must do a linear scan for up to this many bytes to find the correct position in the log to begin and end the fetch. So setting this value to be larger will mean larger index files (and a bit more memory usage) but less scanning. However the server will never add more than one index entry per log append (even if more than log.index.interval worth of messages are appended). In general you probably don't need to mess with this value."
    },
    "log.flush.interval.messages": {
      "scope": "broker",
      "default": "None",
      "description": "The number of messages written to a log partition before we force an fsync on the log. Setting this lower will sync data to disk more often but will have a major impact on performance. We generally recommend that people make use of replication for durability rather than depending on single-server fsync, however this setting can be used to be extra certain."
    },
    "log.flush.scheduler.interval.ms": {
      "scope": "broker",
      "default": "3000",
      "description": "The frequency in ms that the log flusher checks whether any log is eligible to be flushed to disk."
    },
    "log.flush.interval.ms": {
      "scope": "broker",
      "default": "None",
      "description": "The maximum time between fsync calls on the log. If used in conjuction with log.flush.interval.messages the log will be flushed when either criteria is met."
    },
    "log.delete.delay.ms": {
      "scope": "broker",
      "default": "60000",
      "description": "The period of time we hold log files around after they are removed from the in-memory segment index. This period of time allows any in-progress reads to complete uninterrupted without locking. You generally don't need to change this."
    },
    "log.flush.offset.checkpoint.interval.ms": {
      "scope": "broker",
      "default": "60000",
      "description": "The frequency with which we checkpoint the last flush point for logs for recovery. You should not need to change this."
    },
    "auto.create.topics.enable": {
      "scope": "broker",
      "default": "true",
      "description": "Enable auto creation of topic on the server.  If this is set to true then attempts to produce, consume, or fetch metadata for a non-existent topic will automatically create it with the default replication factor and number of partitions."
    },
    "controller.socket.timeout.ms": {
      "scope": "broker",
      "default": "30000",
      "description": "The socket timeout for commands from the partition management controller to the replicas."
    },
    "controller.message.queue.size": {
      "scope": "broker",
      "default": "10",
      "description": "The buffer size for controller-to-broker-channels"
    },
    "default.replication.factor": {
      "scope": "broker",
      "default": "1",
      "description": "The default replication factor for automatically created topics."
    },
    "replica.lag.time.max.ms": {
      "scope": "broker",
      "default": "10000",
      "description": "If a follower hasn't sent any fetch requests for this window of time, the leader will remove the follower from ISR (in-sync replicas) and treat it as dead."
    },
    "replica.lag.max.messages": {
      "scope": "broker",
      "default": "4000",
      "description": "If a replica falls more than this many messages behind the leader, the leader will remove the follower from ISR and treat it as dead."
    },
    "replica.socket.timeout.ms": {
      "scope": "broker",
      "default": "30 * 1000",
      "description": "The socket timeout for network requests to the leader for replicating data."
    },
    "replica.socket.receive.buffer.bytes": {
      "scope": "broker",
      "default": "64 * 1024",
      "description": "The socket receive buffer for network requests to the leader for replicating data."
    },
    "replica.fetch.max.bytes": {
      "scope": "broker",
      "default": "1024 * 1024",
      "description": "The number of byes of messages to attempt to fetch for each partition in the fetch requests the replicas send to the leader."
    },
    "replica.fetch.wait.max.ms": {
      "scope": "broker",
      "default": "500",
      "description": "The maximum amount of time to wait time for data to arrive on the leader in the fetch requests sent by the replicas to the leader."
    },
    "replica.fetch.min.bytes": {
      "scope": "broker",
      "default": "1",
      "description": "Minimum bytes expected for each fetch response for the fetch requests from the replica to the leader. If not enough bytes, wait up to replica.fetch.wait.max.ms for this many bytes to arrive."
    },
    "num.replica.fetchers": {
      "scope": "broker",
      "default": "1",
      "description": "\nNumber of threads used to replicate messages from leaders. Increasing this value can increase the degree of I/O parallelism in the follower broker.\n"
    },
    "replica.high.watermark.checkpoint.interval.ms": {
      "scope": "broker",
      "default": "5000",
      "description": "The frequency with which each replica saves its high watermark to disk to handle recovery."
    },
    "fetch.purgatory.purge.interval.requests": {
      "scope": "broker",
      "default": "10000",
      "description": "The purge interval (in number of requests) of the fetch request purgatory."
    },
    "producer.purgatory.purge.interval.requests": {
      "scope": "broker",
      "default": "10000",
      "description": "The purge interval (in number of requests) of the producer request purgatory."
    },
    "zookeeper.session.timeout.ms": {
      "scope": "broker",
      "default": "6000",
      "description": "ZooKeeper session timeout. If the server fails to heartbeat to ZooKeeper within this period of time it is considered dead. If you set this too low the server may be falsely considered dead; if you set it too high it may take too long to recognize a truly dead server."
    },
    "zookeeper.connection.timeout.ms": {
      "scope": "broker",
      "default": "6000",
      "description": "The maximum amount of time that the client waits to establish a connection to zookeeper."
    },
    "zookeeper.sync.time.ms": {
      "scope": "broker",
      "default": "2000",
      "description": "How far a ZK follower can be behind a ZK leader."
    },
    "controlled.shutdown.enable": {
      "scope": "broker",
      "default": "false",
      "description": "Enable controlled shutdown of the broker. If enabled, the broker will move all leaders on it to some other brokers before shutting itself down. This reduces the unavailability window during shutdown."
    },
    "controlled.shutdown.max.retries": {
      "scope": "broker",
      "default": "3",
      "description": "Number of retries to complete the controlled shutdown successfully before executing an unclean shutdown."
    },
    "controlled.shutdown.retry.backoff.ms": {
      "scope": "broker",
      "default": "5000",
      "description": "Backoff time between shutdown retries."
    },
    "auto.leader.rebalance.enable": {
      "scope": "broker",
      "default": "false",
      "description": "If this is enabled the controller will automatically try to balance leadership for partitions among the brokers by periodically returning leadership to the \"preferred\" replica for each partition if it is available."
    },
    "leader.imbalance.per.broker.percentage": {
      "scope": "broker",
      "default": "10",
      "description": "The percentage of leader imbalance allowed per broker. The controller will rebalance leadership if this ratio goes above\n       the configured value per broker."
    },
    "leader.imbalance.check.interval.seconds": {
      "scope": "broker",
      "default": "300",
      "description": "The frequency with which to check for leader imbalance."
    },
    "offset.metadata.max.bytes": {
      "scope": "broker",
      "default": "1024",
      "description": "The maximum amount of metadata to allow clients to save with their offsets."
    }
  },
  "topic": {
    "cleanup.policy": {
      "scope": "topic",
      "default": "delete",
      "server_default_property": "log.cleanup.policy",
      "description": "A string that is either \"delete\" or \"compact\". This string designates the retention policy to use on old log segments. The default policy (\"delete\") will discard old segments when their retention time or size limit has been reached. The \"compact\" setting will enable log compaction on the topic."
    },
    "delete.retention.ms": {
      "scope": "topic",
      "default": "86400000 (24 hours)",
      "server_default_property": "log.cleaner.delete.retention.ms",
      "description": "The amount of time to retain delete tombstone markers for log compacted topics. This setting also gives a bound on the time in which a consumer must complete a read if they begin from offset 0 to ensure that they get a valid snapshot of the final stage (otherwise delete tombstones may be collected before they complete their scan)."
    },
    "flush.messages": {
      "scope": "topic",
      "default": "None",
      "server_default_property": "log.flush.interval.messages",
      "description": "This setting allows specifying an interval at which we will force an fsync of data written to the log. For example if this was set to 1 we would fsync after every message; if it were 5 we would fsync after every five messages. In general we recommend you not set this and use replication for durability and allow the operating system's background flush capabilities as it is more efficient. This setting can be overridden on a per-topic basis (see the per-topic configuration section)."
    },
    "flush.ms": {
      "scope": "topic",
      "default": "None",
      "server_default_property": "log.flush.interval.ms",
      "description": "This setting allows specifying a time interval at which we will force an fsync of data written to the log. For example if this was set to 1000 we would fsync after 1000 ms had passed. In general we recommend you not set this and use replication for durability and allow the operating system's background flush capabilities as it is more efficient."
    },
    "index.interval.bytes": {
      "scope": "topic",
      "default": "4096",
      "server_default_property": "log.index.interval.bytes",
      "description": "This setting controls how frequently Kafka adds an index entry to it's offset index. The default setting ensures that we index a message roughly every 4096 bytes. More indexing allows reads to jump closer to the exact position in the log but makes the index larger. You probably don't need to change this."
    },
    "max.message.bytes": {
      "scope": "topic",
      "default": "1,000,000",
      "server_default_property": "message.max.bytes",
      "description": "This is largest message size Kafka will allow to be appended to this topic. Note that if you increase this size you must also increase your consumer's fetch size so they can fetch messages this large."
    },
    "min.cleanable.dirty.ratio": {
      "scope": "topic",
      "default": "0.5",
      "server_default_property": "log.cleaner.min.cleanable.ratio",
      "description": "This configuration controls how frequently the log compactor will attempt to clean the log (assuming log compaction is enabled). By default we will avoid cleaning a log where more than 50% of the log has been compacted. This ratio bounds the maximum space wasted in the log by duplicates (at 50% at most 50% of the log could be duplicates). A higher ratio will mean fewer, more efficient cleanings but will mean more wasted space in the log."
    },
    "retention.bytes": {
      "scope": "topic",
      "default": "None",
      "server_default_property": "log.retention.bytes",
      "description": "This configuration controls the maximum size a log can grow to before we will discard old log segments to free up space if we are using the \"delete\" retention policy. By default there is no size limit only a time limit."
    },
    "retention.ms": {
      "scope": "topic",
      "default": "7 days",
      "server_default_property": "log.retention.minutes",
      "description": "This configuration controls the maximum time we will retain a log before we will discard old log segments to free up space if we are using the \"delete\" retention policy. This represents an SLA on how soon consumers must read their data."
    },
    "segment.bytes": {
      "scope": "topic",
      "default": "1 GB",
      "server_default_property": "log.segment.bytes",
      "description": "This configuration controls the segment file size for the log. Retention and cleaning is always done a file at a time so a larger segment size means fewer files but less granular control over retention."
    },
    "segment.index.bytes": {
      "scope": "topic",
      "default": "10 MB",
      "server_default_property": "log.index.size.max.bytes",
      "description": "This configuration controls the size of the index that maps offsets to file positions. We preallocate this index file and shrink it only after log rolls. You generally should not need to change this setting."
    },
    "segment.ms": {
      "scope": "topic",
      "default": "7 days",
      "server_default_property": "log.roll.hours",
      "description": "This configuration controls the period of time after which Kafka will force the log to roll even if the segment file isn't full to ensure that retention can delete or compact old data."
    }
  },
  "producer": {
    "group.id": {
      "scope": "producer",
      "default": null,
      "description": "A string that uniquely identifies the group of consumer processes to which this consumer belongs. By setting the same group id multiple processes indicate that they are all part of the same consumer group."
    },
    "zookeeper.connect": {
      "scope": "producer",
      "default": null,
      "description": "Specifies the ZooKeeper connection string in the form hostname:port where host and port are the host and port of a ZooKeeper server. To allow connecting through other ZooKeeper nodes when that ZooKeeper machine is down you can also specify multiple hosts in the form hostname1:port1,hostname2:port2,hostname3:port3.\n        \n    The server may also have a ZooKeeper chroot path as part of it's ZooKeeper connection string which puts its data under some path in the global ZooKeeper namespace. If so the consumer should use the same chroot path in its connection string. For example to give a chroot path of /chroot/path you would give the connection string as  hostname1:port1,hostname2:port2,hostname3:port3/chroot/path."
    },
    "consumer.id": {
      "scope": "producer",
      "default": "null",
      "description": "\nGenerated automatically if not set.\n"
    },
    "socket.timeout.ms": {
      "scope": "producer",
      "default": "30 * 1000",
      "description": "The socket timeout for network requests. The actual timeout set will be max.fetch.wait + socket.timeout.ms."
    },
    "socket.receive.buffer.bytes": {
      "scope": "producer",
      "default": "64 * 1024",
      "description": "The socket receive buffer for network requests"
    },
    "fetch.message.max.bytes": {
      "scope": "producer",
      "default": "1024 * 1024",
      "description": "The number of byes of messages to attempt to fetch for each topic-partition in each fetch request. These bytes will be read into memory for each partition, so this helps control the memory used by the consumer. The fetch request size must be at least as large as the maximum message size the server allows or else it is possible for the producer to send messages larger than the consumer can fetch."
    },
    "auto.commit.enable": {
      "scope": "producer",
      "default": "true",
      "description": "If true, periodically commit to ZooKeeper the offset of messages already fetched by the consumer. This committed offset will be used when the process fails as the position from which the new consumer will begin."
    },
    "auto.commit.interval.ms": {
      "scope": "producer",
      "default": "60 * 1000",
      "description": "The frequency in ms that the consumer offsets are committed to zookeeper."
    },
    "queued.max.message.chunks": {
      "scope": "producer",
      "default": "10",
      "description": "Max number of message chunks buffered for consumption. Each chunk can be up to fetch.message.max.bytes."
    },
    "rebalance.max.retries": {
      "scope": "producer",
      "default": "4",
      "description": "When a new consumer joins a consumer group the set of consumers attempt to \"rebalance\" the load to assign partitions to each consumer. If the set of consumers changes while this assignment is taking place the rebalance will fail and retry. This setting controls the maximum number of attempts before giving up."
    },
    "fetch.min.bytes": {
      "scope": "producer",
      "default": "1",
      "description": "The minimum amount of data the server should return for a fetch request. If insufficient data is available the request will wait for that much data to accumulate before answering the request."
    },
    "fetch.wait.max.ms": {
      "scope": "producer",
      "default": "100",
      "description": "The maximum amount of time the server will block before answering the fetch request if there isn't sufficient data to immediately satisfy fetch.min.bytes"
    },
    "rebalance.backoff.ms": {
      "scope": "producer",
      "default": "2000",
      "description": "Backoff time between retries during rebalance."
    },
    "refresh.leader.backoff.ms": {
      "scope": "producer",
      "default": "200",
      "description": "Backoff time to wait before trying to determine the leader of a partition that has just lost its leader."
    },
    "auto.offset.reset": {
      "scope": "producer",
      "default": "largest",
      "description": "\nWhat to do when there is no initial offset in ZooKeeper or if an offset is out of range:* smallest : automatically reset the offset to the smallest offset* largest : automatically reset the offset to the largest offset* anything else: throw exception to the consumer\n"
    },
    "consumer.timeout.ms": {
      "scope": "producer",
      "default": "-1",
      "description": "Throw a timeout exception to the consumer if no message is available for consumption after the specified interval"
    },
    "client.id": {
      "scope": "producer",
      "default": "group id value",
      "description": "The client id is a user-specified string sent in each request to help trace calls. It should logically identify the application making the request."
    },
    "zookeeper.session.timeout.ms": {
      "scope": "producer",
      "default": "6000",
      "description": "ZooKeeper session timeout. If the consumer fails to heartbeat to ZooKeeper for this period of time it is considered dead and a rebalance will occur."
    },
    "zookeeper.connection.timeout.ms": {
      "scope": "producer",
      "default": "6000",
      "description": "The max time that the client waits while establishing a connection to zookeeper."
    },
    "zookeeper.sync.time.ms": {
      "scope": "producer",
      "default": "2000",
      "description": "How far a ZK follower can be behind a ZK leader"
    }
  },
  "consumer": {
    "metadata.broker.list": {
      "scope": "consumer",
      "default": null,
      "description": "\nThis is for bootstrapping and the producer will only use it for getting metadata (topics, partitions and replicas). The socket connections for sending the actual data will be established based on the broker information returned in the metadata. The format is host1:port1,host2:port2, and the list can be a subset of brokers or a VIP pointing to a subset of brokers.\n"
    },
    "request.required.acks": {
      "scope": "consumer",
      "default": "0",
      "description": "\nThis value controls when a produce request is considered completed. Specifically, how many other brokers must have committed the data to their log and acknowledged this to the leader? Typical values are \n           \n0, which means that the producer never waits for an acknowledgement from the broker (the same behavior as 0.7). This option provides the lowest latency but the weakest durability guarantees (some data will be lost when a server fails).\n              1, which means that the producer gets an acknowledgement after the leader replica has received the data. This option provides better durability as the client waits until the server acknowledges the request as successful (only messages that were written to the now-dead leader but not yet replicated will be lost).\n              -1, which means that the producer gets an acknowledgement after all in-sync replicas have received the data. This option provides the best durability, we guarantee that no messages will be lost as long as at least one in sync replica remains.\n            \n\n"
    },
    "request.timeout.ms": {
      "scope": "consumer",
      "default": "10000",
      "description": "The amount of time the broker will wait trying to meet the request.required.acks requirement before sending back an error to the client."
    },
    "producer.type": {
      "scope": "consumer",
      "default": "sync",
      "description": "\nThis parameter specifies whether the messages are sent asynchronously in a background thread. Valid values are (1) async for asynchronous send and (2) sync for synchronous send. By setting the producer to async we allow batching together of requests (which is great for throughput) but open the possibility of a failure of the client machine dropping unsent data.\n"
    },
    "serializer.class": {
      "scope": "consumer",
      "default": "kafka.serializer.DefaultEncoder",
      "description": "The serializer class for messages. The default encoder takes a byte[] and returns the same byte[]."
    },
    "key.serializer.class": {
      "scope": "consumer",
      "default": null,
      "description": "The serializer class for keys (defaults to the same as for messages if nothing is given)."
    },
    "partitioner.class": {
      "scope": "consumer",
      "default": "kafka.producer.DefaultPartitioner",
      "description": "The partitioner class for partitioning messages amongst sub-topics. The default partitioner is based on the hash of the key."
    },
    "compression.codec": {
      "scope": "consumer",
      "default": "none",
      "description": "\nThis parameter allows you to specify the compression codec for all data generated by this producer. Valid values are \"none\", \"gzip\" and \"snappy\".\n"
    },
    "compressed.topics": {
      "scope": "consumer",
      "default": "null",
      "description": "\nThis parameter allows you to set whether compression should be turned on for particular topics. If the compression codec is anything other than NoCompressionCodec, enable compression only for specified topics if any. If the list of compressed topics is empty, then enable the specified compression codec for all topics. If the compression codec is NoCompressionCodec, compression is disabled for all topics\n"
    },
    "message.send.max.retries": {
      "scope": "consumer",
      "default": "3",
      "description": "\nThis property will cause the producer to automatically retry a failed send request. This property specifies the number of retries when such failures occur. Note that setting a non-zero value here can lead to duplicates in the case of network errors that cause a message to be sent but the acknowledgement to be lost.\n"
    },
    "retry.backoff.ms": {
      "scope": "consumer",
      "default": "100",
      "description": "\nBefore each retry, the producer refreshes the metadata of relevant topics to see if a new leader has been elected. Since leader election takes a bit of time, this property specifies the amount of time that the producer waits before refreshing the metadata.\n"
    },
    "topic.metadata.refresh.interval.ms": {
      "scope": "consumer",
      "default": "600 * 1000",
      "description": "\nThe producer generally refreshes the topic metadata from brokers when there is a failure (partition missing, leader not available...). It will also poll regularly (default: every 10min so 600000ms). If you set this to a negative value, metadata will only get refreshed on failure. If you set this to zero, the metadata will get refreshed after each message sent (not recommended). Important note: the refresh happen only AFTER the message is sent, so if the producer never sends a message the metadata is never refreshed\n"
    },
    "queue.buffering.max.ms": {
      "scope": "consumer",
      "default": "5000",
      "description": "Maximum time to buffer data when using async mode. For example a setting of 100 will try to batch together 100ms of messages to send at once. This will improve throughput but adds message delivery latency due to the buffering."
    },
    "queue.buffering.max.messages": {
      "scope": "consumer",
      "default": "10000",
      "description": "The maximum number of unsent messages that can be queued up the producer when using async mode before either the producer must be blocked or data must be dropped."
    },
    "queue.enqueue.timeout.ms": {
      "scope": "consumer",
      "default": "-1",
      "description": "\nThe amount of time to block before dropping messages when running in async mode and the buffer has reached queue.buffering.max.messages. If set to 0 events will be enqueued immediately or dropped if the queue is full (the producer send call will never block). If set to -1 the producer will block indefinitely and never willingly drop a send.\n"
    },
    "batch.num.messages": {
      "scope": "consumer",
      "default": "200",
      "description": "The number of messages to send in one batch when using async mode. The producer will wait until either this number of messages are ready to send or queue.buffer.max.ms is reached."
    },
    "send.buffer.bytes": {
      "scope": "consumer",
      "default": "100 * 1024",
      "description": "Socket write buffer size"
    },
    "client.id": {
      "scope": "consumer",
      "default": "\"\"",
      "description": "The client id is a user-specified string sent in each request to help trace calls. It should logically identify the application making the request."
    }
  }
}